/*===================
 	ScoreMain.java
=====================*/
/*
○ 성적 처리 → 데이터베이스 연동(데이터베이스 연결 및 액션 처리)
 				ScoreDTO 클래스 활용 (속성만 존재하는 클래스 getter/ setter)
 				ScoreDAO 클래스 활용 (데이터베이스 액션 처리)
 				Process  클래스 활용 (업무 단위 기능 구성)
 				DBConn   클래스 활용 (데이터베이스 연결 전담 전용 객체 처리)
 				
여러 명의 이름, 국어점수, 영어점수, 수학점수를 입력받아
총점, 평균, 석차 등을 계산하여 출력하는 프로그램을 구현한다.
※ 서브 메뉴 구성 → Process 클래스 활용

실행 예)
===[성적 처리]===
1. 성적 입력
2. 성적 전체 출력
3. 이름 검색 출력
4. 성적 수정
5. 성적 삭제
=================
>> 선택 (1~5, -1종료) : 1

7번 학생 성적 입력(이름 국어 영어 수학)  : 이시우 50 60 70
성적 입력이 완료되었습니다.

8번 학생 성적 입력(이름 국어 영어 수학)  : 이지연 80 80 80
성적 입력이 완료되었습니다.

9번 학생 성적 입력(이름 국어 영어 수학)  : .

===[성적 처리]===
1. 성적 입력
2. 성적 전체 출력
3. 이름 검색 출력
4. 성적 수정
5. 성적 삭제
=================
>> 선택 (1~5, -1종료) : 2

전체 인원 : 8명
번호	이름	국어 	영어	수학	총점	평균	석차
1
2
3
4					....
5
6
7
8

===[성적 처리]===
1. 성적 입력
2. 성적 전체 출력
3. 이름 검색 출력
4. 성적 수정
5. 성적 삭제
=================
>> 선택 (1~5, -1종료) : -1

프로그램이 종료되었습니다..
			
 */
package com.test;

import java.util.Scanner;

public class ScoreMain
{
	public static void main(String[] args)
	{
		Process prc = new Process();
		Scanner sc = new Scanner(System.in);

		
		do
		{
			System.out.println();
			System.out.println("===[성적 처리]===");
			System.out.println("1. 성적 입력");
			System.out.println("2. 성적 전체 출력");
			System.out.println("3. 이름 검색 출력");
			System.out.println("4. 성적 수정");
			System.out.println("5. 성적 삭제");
			System.out.println("=================");
			System.out.print(">> 선택 (1~5, -1종료) : ");
			String menus = sc.next();
			
			try
			{
				int menu = Integer.parseInt(menus);
				
				if (menu == -1)
				{
					System.out.println();
					System.out.println("프로그램이 종료되었습니다.");
					return;
				}
				
				switch (menu)
				{
				case 1:
					// 성적 입력 기능 수행
					prc.sungjukInsert();
					break;

				case 2:
					// 성적 전체 출력 기능 수행
					prc.sungjukSelectAll();
					break;
					
				case 3: 
					// 이름 검색 출력 기능 수행
					prc.sungjukSearchName();
					break;
					
				case 4:
					// 성적 수정 기능  수행
					prc.sungjukUpdate();
					break;
					
				case 5:
					prc.sungjukDelete();
					// 성적 삭제 기능 수행
				}

			} catch (Exception e)
			{
				System.out.println(e.toString());
			}
			
		} while (true); 

	}
}

/*
===[성적 처리]===
1. 성적 입력
2. 성적 전체 출력
3. 이름 검색 출력
4. 성적 수정
5. 성적 삭제
=================
>> 선택 (1~5, -1종료) : 2

전체 인원 : 4명
번호	이름	국어  영어  수학   총점   평균   석차
  1   한충희    10     20     30     60   20.0      4
  2   양윤정    50     60     70    180   60.0      3
  3   서민지    60     70     80    210   70.0      2
  4   이시우    70     80     90    240   80.0      1

===[성적 처리]===
1. 성적 입력
2. 성적 전체 출력
3. 이름 검색 출력
4. 성적 수정
5. 성적 삭제
=================
>> 선택 (1~5, -1종료) : 3
검색할 이름 입력 : 이시우
번호	이름	국어  영어  수학   총점   평균   석차
  4   이시우    70     80     90    240   80.0      1

===[성적 처리]===
1. 성적 입력
2. 성적 전체 출력
3. 이름 검색 출력
4. 성적 수정
5. 성적 삭제
=================
>> 선택 (1~5, -1종료) : 4
수정할 번호를 입력하세요 :  1
번호	이름	국어  영어  수학   총점   평균   석차
  1   한충희    10     20     30     60   20.0      4
  2   양윤정    50     60     70    180   60.0      3
  3   서민지    60     70     80    210   70.0      2
  4   이시우    70     80     90    240   80.0      1

수정 데이터 입력 (이름 국어 영어 수학) : 
김민성
60
70
80
수정이 완료되었습니다.

===[성적 처리]===
1. 성적 입력
2. 성적 전체 출력
3. 이름 검색 출력
4. 성적 수정
5. 성적 삭제
=================
>> 선택 (1~5, -1종료) : 2

전체 인원 : 4명
번호	이름	국어  영어  수학   총점   평균   석차
  1   김민성    60     70     80    210   70.0      2
  2   양윤정    50     60     70    180   60.0      4
  3   서민지    60     70     80    210   70.0      2
  4   이시우    70     80     90    240   80.0      1

===[성적 처리]===
1. 성적 입력
2. 성적 전체 출력
3. 이름 검색 출력
4. 성적 수정
5. 성적 삭제
=================
>> 선택 (1~5, -1종료) : 4
수정할 번호를 입력하세요 :  .
java.util.InputMismatchException

===[성적 처리]===
1. 성적 입력
2. 성적 전체 출력
3. 이름 검색 출력
4. 성적 수정
5. 성적 삭제
=================
>> 선택 (1~5, -1종료) : 5
삭제할 번호를 입력하세요 :  1
번호	이름	국어  영어  수학   총점   평균   석차
  1   김민성    60     70     80    210   70.0      2
  2   양윤정    50     60     70    180   60.0      4
  3   서민지    60     70     80    210   70.0      2
  4   이시우    70     80     90    240   80.0      1
>> 정말 삭제하시겠습니까?? (Y/N) : y
삭제가 완료되었습니다.

===[성적 처리]===
1. 성적 입력
2. 성적 전체 출력
3. 이름 검색 출력
4. 성적 수정
5. 성적 삭제
=================
>> 선택 (1~5, -1종료) : 5
삭제할 번호를 입력하세요 : 7
삭제할 대상이 존재하지 않습니다.

===[성적 처리]===
1. 성적 입력
2. 성적 전체 출력
3. 이름 검색 출력
4. 성적 수정
5. 성적 삭제
=================
>> 선택 (1~5, -1종료) : 5
삭제할 번호를 입력하세요 : 4
번호	이름	국어  영어  수학   총점   평균   석차
  2   양윤정    50     60     70    180   60.0      3
  3   서민지    60     70     80    210   70.0      2
  4   이시우    70     80     90    240   80.0      1
>> 정말 삭제하시겠습니까?? (Y/N) : n
취소되었습니다.

===[성적 처리]===
1. 성적 입력
2. 성적 전체 출력
3. 이름 검색 출력
4. 성적 수정
5. 성적 삭제
=================
>> 선택 (1~5, -1종료) : 2

전체 인원 : 3명
번호	이름	국어  영어  수학   총점   평균   석차
  2   양윤정    50     60     70    180   60.0      3
  3   서민지    60     70     80    210   70.0      2
  4   이시우    70     80     90    240   80.0      1

===[성적 처리]===
1. 성적 입력
2. 성적 전체 출력
3. 이름 검색 출력
4. 성적 수정
5. 성적 삭제
=================
>> 선택 (1~5, -1종료) : 
 */
































